# Задача 10: 
# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть

# 1 - герб, 0 - решка
# Ввод:
# 4 - число монет
# 0
# 1
# 1
# 1
# Вывод:
# 1

n = int(input('Enter number of coins: '))
turn_over = 0

for i in range(n):
    coin = int(input(f'coin {i + 1}: '))
    if coin == 0:
        turn_over += 1
print(turn_over)
